StartMilandr/MDR_Pack_v6/SVD_Files/RST/MDR1986VE1_RST.svd
            <!-- ADC_CLOCK.AUC_C1_SEL -->
            <!--#BE3-->
            <!--field derivedFrom="MDR_RST_CLOCK.CPU_CLOCK.CPU_C1_SEL">
              <name>AUC_C1_SEL</name>
              <description>AUC_C1 mux input select</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <!-- ADC_CLOCK.AUC_C2_SEL -->
            <!--#BE3-->
            <!--field>
              <name>AUC_C2_SEL</name>
              <description>AUC_C2 mux input select</description>
              <bitRange>[21:20]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__ADC__AUC_C2_</headerEnumName>
                <enumeratedValue>
                  <name>AUC_C1</name>
                  <description>AUC_C2 output is AUC_C1 select</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLLCPUo</name>
                  <description>AUC_C2 output is PLLCPUo</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLLUSBo</name>
                  <description>AUC_C2 output is PLLUSBo</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0</name>
                  <description>No signal from AUC_C2</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- ADC_CLOCK.AUC_C3_SEL -->
            <!--#BE3-->
            <!--field derivedFrom="ADC_C3_SEL">
              <name>AUC_C3_SEL</name>
              <description>AUC_C3 mux input select</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
            </field>
            <!-- ADC_CLOCK.AUC_CLK_EN -->
            <!--#BE3-->
            <!--field>
              <name>AUC_CLK_EN</name>
              <description>AudioCodec Clock Enable</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__ADC__AUC_EN_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>AUC clock disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>AUC clock enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>

            <!-- ADC_CLOCK fields end-->
          </fields>
        </register>

        <!-- ADC_CLOCK-->
        <!--#BE4,#BK214,#BK234-->
        <!--register>
          <name>ADC_CLOCK</name>
          <description>ADC Clock Control</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00003F33</resetMask>
          <fields>
            <!-- ADC_CLOCK.ADC_C1_SEL -->
            <!--field>
              <name>ADC_C1_SEL</name>
              <description>ADC_C1 mux freq select</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__ADC__C1_</headerEnumName>
                <enumeratedValue>
                  <name>CPU_C1</name>
                  <description>ADC_C1 output is CPU_C1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER1_C1</name>
                  <description>ADC_C1 output is PER1_C1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLLCPUo</name>
                  <description>ADC_C1 output is PLLCPUo</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSI_C1</name>
                  <description>ADC_C1 output is HSI_C1</description>
                  <value>3</value>
                </enumeratedValue>                                
              </enumeratedValues>
            </field>
            <!-- ADC_CLOCK.ADCIU_C1_SEL -->
            <!--field>
              <name>ADCIU_C1_SEL</name>
              <description>ADCIU_C1 mux freq select</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__ADCIU__C1_</headerEnumName>
                <enumeratedValue>
                  <name>CPU_C1</name>
                  <description>ADCIU_C1 output is CPU_C1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER1_C1</name>
                  <description>ADCIU_C1 output is PER1_C1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLLCPUo</name>
                  <description>ADCIU_C1 output is PLLCPUo</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSI_C1</name>
                  <description>ADCIU_C1 output is HSI_C1</description>
                  <value>3</value>
                </enumeratedValue>                                
              </enumeratedValues>
            </field>
            <!-- ADC_CLOCK.ADC_C3_SEL -->
            <!--field derivedFrom="MDR_RST_CLOCK.CPU_CLOCK.CPU_C3_SEL">
              <name>ADC_C3_SEL</name>
              <description>ADC_C1 mux output freq devider, [/1, /2, /4 .. /256]</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <!-- ADC_CLOCK.ADCIU_C3_SEL -->
            <!--field derivedFrom="MDR_RST_CLOCK.CPU_CLOCK.CPU_C3_SEL">
              <name>ADCIU_C3_SEL</name>
              <description>ADCIU_C1 mux output freq devider, [/1, /2, /4 .. /256]</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <!-- ADC_CLOCK.ADCIU_CLK_EN -->
            <!--field>
              <name>ADCIU_CLK_EN</name>
              <description>ADCIU Clock Enable</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__ADCIU__CLK_EN_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>ADCIU clock disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>ADCIU clock enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- ADC_CLOCK.ADC_CLK_EN -->
            <!--field>
              <name>ADC_CLK_EN</name>
              <description>ADC Clock Enable</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__ADC__CLK_EN_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>ADC clock disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>ADC clock enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- ADC_CLOCK fields end-->
          <!--/fields>
        </register-->

        <!-- RTC_CLOCK-->
        <register>
          <name>RTC_CLOCK</name>
          <description>RTC Clock Control</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000003FF</resetMask>
          <fields>
            <!-- RTC_CLOCK.HSE_SEL -->
            <field derivedFrom="MDR_RST_CLOCK.CPU_CLOCK.CPU_C3_SEL">
              <name>HSE_SEL</name>
              <description>RTC HSE freq devider, [/1, /2, /4 .. /256]</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <!-- RTC_CLOCK.HSI_SEL -->
            <field derivedFrom="MDR_RST_CLOCK.CPU_CLOCK.CPU_C3_SEL">
              <name>HSI_SEL</name>
              <description>RTC HSI freq devider, [/1, /2, /4 .. /256]</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>            
            <!-- RTC_CLOCK.HSE_RTC_EN -->
            <field>
              <name>HSE_RTC_EN</name>
              <description>RTC HSE Clock enable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__RTC__HSE_RTC_CLOCK_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>RTC HSE Clock Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>RTC HSE Clock Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- RTC_CLOCK.HSI_RTC_EN -->
            <field>
              <name>HSI_RTC_EN</name>
              <description>RTC HSI Clock enable</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__RTC__HSI_RTC_CLOCK_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>RTC HSI Clock Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>RTC HSI Clock Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- RTC_CLOCK fields end-->
          </fields>
        </register>        

        <!-- PER_CLOCK 0x1C-->
        <!--#BE1,#BE3,#BE9x, #VC1-->
        <register>
          <name>PER_CLOCK</name>
          <description>Peripherials Clock Control</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000010</resetValue>
          <resetMask>0xFFFFFFFF</resetMask><!--#BE1,#BE3,#VC1-->
          <!--resetMask>0x6BFFFDFF</resetMask--><!--#BE9x-->
          <fields>
            <!-- PER_CLOCK.CAN1_CLK_EN -->
            <!--#BE1,#BE3,#BE9x-->
            <field>
              <name>CAN1_CLK_EN</name>
              <description>CAN1 Clock Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__PER__CAN1_CLOCK_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>Clock Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>Clock Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!--#VC1-->
            <!--field>
              <name>SSP3_CLK_EN</name>
              <description>SSP3 Clock Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__PER__SSP3_CLOCK_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>Clock Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>Clock Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field-->            
            <!--#BE1,#BE3,#BE9x-->
            <field derivedFrom="CAN1_CLK_EN">
              <name>CAN2_CLK_EN</name>
              <description>CAN2 Clock Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <!--#VC1-->
            <!--field derivedFrom="SSP3_CLK_EN">
              <name>SSP4_CLK_EN</name>
              <description>SSP4 Clock Enable</description>
              <bitRange>[1:1]</bitRange>
            </field-->

            <!-- PER_CLOCK.USB_CLK_EN -->
            <field>
              <name>USB_CLK_EN</name>
              <description>USB Clock Enable</description>
              <bitRange>[2:2]</bitRange>
              <enumeratedValues>
                <headerEnumName>MDR_RST__PER__SSP_CLOCK_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>Clock Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>Clock Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>              
            </field>
            <!-- PER_CLOCK.EEPROM_CLK_EN -->
            <field derivedFrom="USB_CLK_EN">
              <name>EEPROM_CLK_EN</name>
              <description>EEPROM Controller Clock Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <!-- PER_CLOCK.RST_CLK_EN -->
            <field derivedFrom="USB_CLK_EN">
              <name>RST_CLK_EN</name>
              <description>RST Clock Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <!-- PER_CLOCK.DMA_CLK_EN -->
            <field derivedFrom="USB_CLK_EN">
              <name>DMA_CLK_EN</name>
              <description>DMA Clock Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <!-- PER_CLOCK.UART1_CLK_EN -->
            <field derivedFrom="USB_CLK_EN">
              <name>UART1_CLK_EN</name>
              <description>UART1 Clock Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <!-- PER_CLOCK.UART2_CLK_EN -->
            <field derivedFrom="USB_CLK_EN">
              <name>UART2_CLK_EN</name>
              <description>UART2 Clock Enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <!-- PER_CLOCK.SPI1_CLK_EN -->
            <field derivedFrom="USB_CLK_EN">
              <name>SPI1_CLK_EN</name>
              <description>SPI1 Clock Enable</description>
              <bitRange>[8:8]</bitRange>
            </field>

            <!-- PER_CLOCK.MIL1_CLK_EN -->
            <!--#BE1,#BE3-->
            <field derivedFrom="USB_CLK_EN">
              <name>MIL1_CLK_EN</name>
              <description>MIL1 Clock Enable</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <!-- PER_CLOCK.SDIO_CLK_EN -->
            <!--#VC1-->
            <!--field derivedFrom="USB_CLK_EN">
              <name>SDIO_CLK_EN</name>
              <description>SDIO Clock Enable</description>
              <bitRange>[9:9]</bitRange>
            </field-->

            <!-- PER_CLOCK.MIL2_CLK_EN -->
            <!--#BE1,#BE3-->
            <field derivedFrom="USB_CLK_EN">
              <name>MIL2_CLK_EN</name>
              <description>MIL2 Clock Enable</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <!-- PER_CLOCK.I2C_CLK_EN -->
            <!--#BE9x,#VC1-->
            <!--field derivedFrom="USB_CLK_EN">
              <name>I2C_CLK_EN</name>
              <description>I2C Clock Enable</description>
              <bitRange>[10:10]</bitRange>
            </field-->

            <!-- PER_CLOCK.PWR_CLK_EN -->
            <field derivedFrom="USB_CLK_EN">
              <name>PWR_CLK_EN</name>
              <description>Power Clock Enable</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <!-- PER_CLOCK.WWDT_CLK_EN -->
            <field derivedFrom="USB_CLK_EN">
              <name>WWDT_CLK_EN</name>
              <description>WWDT Clock Enable</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <!-- PER_CLOCK.IWDT_CLK_EN -->
            <field derivedFrom="USB_CLK_EN">
              <name>IWDT_CLK_EN</name>
              <description>IWDT Clock Enable</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <!-- PER_CLOCK.TIMER1_CLK_EN -->
            <field derivedFrom="USB_CLK_EN">
              <name>TIMER1_CLK_EN</name>
              <description>TIMER1 Clock Enable</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <!-- PER_CLOCK.TIMER2_CLK_EN -->
            <field derivedFrom="USB_CLK_EN">
              <name>TIMER2_CLK_EN</name>
              <description>TIMER2 Clock Enable</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <!-- PER_CLOCK.TIMER3_CLK_EN -->
            <field derivedFrom="USB_CLK_EN">
              <name>TIMER3_CLK_EN</name>
              <description>TIMER3 Clock Enable</description>
              <bitRange>[16:16]</bitRange>
            </field>            
            <!-- PER_CLOCK.ADC_CLK_EN -->
            <field derivedFrom="USB_CLK_EN">
              <name>ADC_CLK_EN</name>
              <description>ADC Clock Enable</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <!-- PER_CLOCK.DAC_CLK_EN -->
            <field derivedFrom="USB_CLK_EN">
              <name>DAC_CLK_EN</name>
              <description>DAC Clock Enable</description>
              <bitRange>[18:18]</bitRange>
            </field>

            <!-- PER_CLOCK.TIMER4_CLK_EN -->
            <!--#BE1,#BE3-->
            <field derivedFrom="USB_CLK_EN">
              <name>TIMER4_CLK_EN</name>
              <description>TIMER4 Clock Enable</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <!-- PER_CLOCK.CMP_CLK_EN -->
            <!--#BE9x,#VC1-->
            <!--field derivedFrom="USB_CLK_EN">
              <name>CMP_CLK_EN</name>
              <description>Comparator Clock Enable</description>
              <bitRange>[19:19]</bitRange>
            </field-->

